Revit 2027 API
BuiltInFailures.AutoRouteFailures.HighlightedElementDisconnected Property
 The highlighted element has been disconnected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HighlightedElementDisconnected { get; }
Public Shared ReadOnly Property HighlightedElementDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HighlightedElementDisconnected {
	FailureDefinitionId^ get ();
}
static member HighlightedElementDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace